In [41]:
## Dependencies and setup
import pandas as pd

In [42]:
## Load data files
hbcny_c_d_19 = "../../1_Extract/USDA-HB_Colony_Health_2019_and_2020/hbcny_collapse_disorder_19and20_t003.csv"

In [43]:
## Read data and store into df
## Drop the first 4 rows which hold info text
hbcny_c_d_19 = pd.read_csv(hbcny_c_d_19, skiprows=4)
## Convert to df
hbcny_c_d_19 = pd.DataFrame(hbcny_c_d_19)
hbcny_c_d_19

,3,h,Year,January-March,April-June,July-September,October-December
0,3,h,NaN,NaN,NaN,NaN,NaN
1,3,u,NaN,(number),(number),(number),(number)
2,3,d,2019,59940,(NA),67240,83710
3,3,d,2020,105240,55830,NaN,NaN
4,3,c,NaN,NaN,NaN,NaN,NaN
5,3,f,(NA) Not available.,NaN,NaN,NaN,NaN

In [44]:
## Drop erroneous first 2 columns
hbcny_c_d_19.drop(hbcny_c_d_19.iloc[:, [0, 1]], axis = 1, inplace = True)
hbcny_c_d_19

,Year,January-March,April-June,July-September,October-December
0,NaN,NaN,NaN,NaN,NaN
1,NaN,(number),(number),(number),(number)
2,2019,59940,(NA),67240,83710
3,2020,105240,55830,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN
5,(NA) Not available.,NaN,NaN,NaN,NaN

In [45]:
## Drop blank rows
hbcny_c_d_19 = hbcny_c_d_19.dropna()
hbcny_c_d_19

   Year January-March April-June July-September October-December
2  2019         59940       (NA)          67240            83710

In [46]:
## Replace "NA" with None so you can sum across
hbcny_c_d_19 = hbcny_c_d_19.replace({"(NA)": None})
hbcny_c_d_19

   Year January-March April-June July-September October-December
2  2019         59940       None          67240            83710

In [47]:
## Check datatype
print(hbcny_c_d_19.dtypes)

Year                object
January-March       object
April-June          object
July-September      object
October-December    object
dtype: object

In [48]:
## Convert from Object to String to Integer in order to sum
## Do not include Q2 since is NaN value
hbcny_c_d_19["January-March"] = hbcny_c_d_19["January-March"].astype(str).astype(int)
#hbcny_c_d_19["April-June"] = hbcny_c_d_19["April-June"].astype(str).astype(int)
hbcny_c_d_19["July-September"] = hbcny_c_d_19["July-September"].astype(str).astype(int)
hbcny_c_d_19["October-December"] = hbcny_c_d_19["October-December"].astype(str).astype(int)

print(hbcny_c_d_19.dtypes)

Year                object
January-March        int32
April-June          object
July-September       int32
October-December     int32
dtype: object

In [49]:
# tot_budget = school_data["budget"].sum()
## Sum colonies lost due to Collapse Disorder in 2019
dflist = ["January-March", "July-September", "October-December"]
hbcny_c_d_19["hbcny_lost_c_d_19"] = hbcny_c_d_19[dflist].sum(axis=1)
hbcny_c_d_19

,Year,January-March,April-June,July-September,October-December,hbcny_lost_c_d_19
2,2019,59940,None,67240,83710,210890

In [50]:
## Reset the index
hbcny_c_d_19 = hbcny_c_d_19.reset_index(drop = True)
hbcny_c_d_19

,Year,January-March,April-June,July-September,October-December,hbcny_lost_c_d_19
0,2019,59940,None,67240,83710,210890

In [51]:
## Drop quarter columns
hbcny_c_d_19.drop(hbcny_c_d_19.iloc[:, [1, 2, 3, 4]], axis = 1, inplace = True)
hbcny_c_d_19

   Year  hbcny_lost_c_d_19
0  2019             210890

In [52]:
## Rename columns
hbcny_c_d_19 = hbcny_c_d_19.rename(columns={
    "Year": "year"
})
hbcny_c_d_19

   year  hbcny_lost_c_d_19
0  2019             210890

In [53]:
hbcny_c_d_19.to_csv("../hbcny_c_d_19.csv", index = False)